Revit 2027 API
Noise.NoiseSize Property
 The property labeled "Size" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string NoiseSize { get; }
Public Shared ReadOnly Property NoiseSize As String
	Get
public:
static property String^ NoiseSize {
	String^ get ();
}
static member NoiseSize : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0.001, 10000000000".
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace